TcpServer.TestRetranslator.Wsdl/Test.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>    
    <wsse:Security wsse:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>'.$username.'</wsse:Username>
        <wsse:Password>'.$password.'</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
    <Security soap:mustUnderstand="1" xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <UsernameToken>
        <Username>braitmonitor</Username>
        <Password>cup6ztd3BvOd</Password>
      </UsernameToken>
    </Security>
    <Security soap:mustUnderstand="1" xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <UsernameToken>
        <Username>braitmonitor</Username>
        <Password>cup6ztd3BvOd</Password>
      </UsernameToken>
    </Security>
  </soap:Header>
  <soap:Body>
    <storeTelemetry xmlns="http://webservice.telemetry.udo.fors.ru/">
      <telemetry xmlns="">
        <coordX>55.66864668528239</coordX>
        <coordY>37.658909988403323</coordY>
        <date>2012-02-16T12:40:15</date>
        <glonass>false</glonass>
        <gpsCode>353358019114490</gpsCode>
        <speed>0</speed>
      </telemetry>
      <telemetryDetails xmlns="">
        <value>0</value>
      </telemetryDetails>
    </storeTelemetry>
  </soap:Body>
</soap:Envelope>